CREATING DATAFRAMES IN PANDAS

In [1]:
import pandas as pd
mydata = pd.read_csv("bigmart.csv")

In [3]:
mydata.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [54]:
mydata.tail(2)

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
8521,FDN46,7.21,Regular,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.80,Low Fat,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [6]:
mydata["Item_Weight"].max()

21.35

In [8]:
maxyr = mydata["Outlet_Establishment_Year"].max()
print ("The max year is ", maxyr)

The max year is  2009

In [9]:
minyr = mydata["Outlet_Establishment_Year"].min()
print ("The minimum year is ", minyr)

The minimum year is  1985

In [13]:
Avearage_sales = mydata["Item_Outlet_Sales"].mean()
print ("The sales average is ", Avearage_sales)

The sales average is  2181.288913575032

In [56]:
mydata.columns

Index(['Item_Identifier', 'Item_Weight', 'Item_Fat_Content', 'Item_Visibility',
       'Item_Type', 'Item_MRP', 'Outlet_Identifier',
       'Outlet_Establishment_Year', 'Outlet_Size', 'Outlet_Location_Type',
       'Outlet_Type', 'Item_Outlet_Sales'],
      dtype='object')

In [63]:
### You can select also the Columns/Features to work with incase the rows are many and interested in all
mydata[['Item_Weight', 'Item_Type', 'Item_MRP', 'Outlet_Establishment_Year', 'Outlet_Size', 'Item_Outlet_Sales']]

,Item_Weight,Item_Type,Item_MRP,Outlet_Establishment_Year,Outlet_Size,Item_Outlet_Sales
0,9.300,Dairy,249.8092,1999,Medium,3735.1380
1,5.920,Soft Drinks,48.2692,2009,Medium,443.4228
2,17.500,Meat,141.6180,1999,Medium,2097.2700
3,19.200,Fruits and Vegetables,182.0950,1998,NaN,732.3800
4,8.930,Household,53.8614,1987,High,994.7052
...,...,...,...,...,...,...
8518,6.865,Snack Foods,214.5218,1987,High,2778.3834
8519,8.380,Baking Goods,108.1570,2002,NaN,549.2850
8520,10.600,Health and Hygiene,85.1224,2004,Small,1193.1136
8521,7.210,Snack Foods,103.1332,2009,Medium,1845.5976
8522,14.800,Soft Drinks,75.4670,1997,Small,765.6700

Using Tuple

In [47]:
import pandas as pd

weather ={
    "dates": ['1/3/2025', '2/3/2025','3/3/2025', '4/3/2025','5/3/2025', '6/3/2025', '7/3/2025'],
    "windspeed": ['23' , '24' ,'23' ,'45' ,'21' , '23' , '21'],
    "TypaDay": ['windy', 'sunny', 'calm', 'sunny' ,'sunny', 'calm','Rainy'],
}
df = pd.DataFrame(weather)

In [48]:
df

      dates windspeed TypaDay
0  1/3/2025        23   windy
1  2/3/2025        24   sunny
2  3/3/2025        23    calm
3  4/3/2025        45   sunny
4  5/3/2025        21   sunny
5  6/3/2025        23    calm
6  7/3/2025        21   Rainy

In [49]:
df.dates

0    1/3/2025
1    2/3/2025
2    3/3/2025
3    4/3/2025
4    5/3/2025
5    6/3/2025
6    7/3/2025
Name: dates, dtype: object

In [50]:
df["dates"]

0    1/3/2025
1    2/3/2025
2    3/3/2025
3    4/3/2025
4    5/3/2025
5    6/3/2025
6    7/3/2025
Name: dates, dtype: object

In [51]:
df.describe()

           dates windspeed TypaDay
count          7         7       7
unique         7         4       4
top     1/3/2025        23   sunny
freq           1         3       3

In [52]:
df.set_index("windspeed", inplace = True) #To define where your data should start
df

              dates TypaDay
windspeed
23         1/3/2025   windy
24         2/3/2025   sunny
23         3/3/2025    calm
45         4/3/2025   sunny
21         5/3/2025   sunny
23         6/3/2025    calm
21         7/3/2025   Rainy